import solution from '../../programmers/lv0/다항식_더하기.js';

describe('다항식 더하기 테스트', () => {
  test.each([
    ['3x + 7', '3x + 7'],
    ['3x', '3x'],
    ['7', '7'],
    ['10x + 8 + 1 + 3x', '13x + 9'],
    ['21x + 8 + 1 + 3x', '24x + 9'],
    ['10x + 8 + 1 + 3 + 3x + 4x + 2', '17x + 14'],
    ['10x + 8 + 1 + 3 + 3x + 4x + 2 + 100x + 100', '117x + 114'],
    [
      '100 + 100 + 100 + 100 + 100 + 100 + 100 + 100 + 100 + 100 + 100 + 100',
      '1200',
    ],
    ['x + 1', 'x + 1'],
  ])('다항식 더하기 테스트', (testData, result) => {
    expect(solution(testData)).toEqual(result);
  });
});
